#include "JsonValue.hpp"

namespace sjson {

// TODO -- РЕалізувати deserialize. Взагалом можна все реалізувати,
//  адже основна проблема уже зараз, це просо спарсити весь стрінг і перетворити його у потрібні типи.
//  Також думаю додати можилвість із файла перетворювати. І реалізувати seriazlize також.
//  З готового ою'єкта буде створюватися json у  виді стрінга.
//  Тут відразу можна зрозуміти, що потрібно буде знати ім'я полів, як у boost::pfr,
//  тому з цим розібратися і самому реаізувати на темлпейтах


}


